[
  {
    "post_id": "1",
    "title": "Malin Kundang",
    "content": "Di sebuah desa, hiduplah seorang perempuan miskin. Ia hidup bersama anak tunggalnya, namanya Malin Kundang. Sehari-hari perempuan itu bekerja sebagai nelayan. Namun, penghasilannya tak bisa mencukupi kebutuhan mereka sehari-hari sehingga hidup mereka selalu berkekurangan. Saat Malin Kundang mulai dewasa, ia memutuskan untuk pergi ke kota. Ia ingin mengadu nasibnya di sana.“Barangkali dengan pergi ke kota, aku bisa mengubah nasib kita, Ibu,” ucap Malin Kundang.Dengan berat hati, ibunya pun mengizinkan. Kini, ibunya kembali menjadi perempuan tua yang kesepian. Setelah kepergian Malin, ibunya selalu memikirkan keadaan anaknya itu. Ia jadi sakit-sakitan, sementara Malin tak pernah mengirim kabar untuknya.Hingga beberapa tahun kemudian, Malin berhasil mengubah nasib. Ia telah menjadi saudagar yang kaya raya. Malin memiliki banyal kapal. Hidup Malin tak lagi susah. Malin juga menikahi seorang perempuan bangsawan yang sangat cantik.Suatu hari, Malin ingin melihat keadaan desanya. Sudah lama sekali ia tak pulang. Malin pergi bersama istri dan banyak pekerjanya. Ia juga membawa banyak uang untuk dibagi-bagikan kepada para penduduk.",
    "createdAt": "15 Desember 2022"
  },
  {
    "post_id": "2",
    "title": "Roro Jongrang",
    "content": "Dahulu kala, di Desa Prambanan, ada sebuah kerajaan yang dipimpin oleh Prabu Baka. la memiliki seorang putri yang sangat cantik bernama Roro Jonggrang.Suatu ketika, Prambanan dikalahkan oleh Kerajaan Pengging yang dipimpin oleh Bandung Bondowoso. Prabu Baka tewas di medan perang. Dia terbunuh oleh Bandung Bondowoso yang sangat sakti.Bandung Bondowoso kemudian menempati Istana Prambanan. Melihat putri dari Prabu Baka yang cantik jelita yaitu Roro Jonggrang, timbul keinginannya untuk memperistri Roro Jonggrang.Roro Jonggrang tahu bahwa Bandung Bondowoso adalah orang yang membunuh ayahnya. Karena itu, ia mencari akal untuk menolaknya. Lalu, ia mengajukan syarat dibuatkan 1.000 buah candi dan dua buah sumur yang dalam. Semuanya harus selesai dalam semalam.Bandung Bondowoso menyanggupi persyaratan Roro Jonggrang. Ia meminta pertolongan kepada ayahnya dan mengerahkan balatentara roh-roh halus untuk membantunya pada hari yang ditentukan. Pukul empat pagi, hanya tinggal lima buah candi yang belum selesai dan kedua sumur hampir selesai.Mengetahui 1.000 candi telah hampir selesai, Roro Jonggrang ketakutan.",
    "createdAt": "16 Desember 2022"
  },
  {
    "post_id": "3",
    "title": "Timun Emas",
    "content": "Mbok Sirni adalah seorang janda yang menginginkan seorang anak. Suatu hari ia didatangi oleh raksasa yang ingin memberi seorang anak dengan syarat apabila anak itu dewasa harus diserahkan ke raksasa itu untuk disantap.Mbok Sirni yang setuju akhirnya menerima biji mentimun dari raksasa yang kemudian ditanam dan dirawat. Setelah dua minggu diantara buah ketimun yang ditanamnya ada satu yang paling besar dan berkilau seperti emas. Dengan hati-hati Mbok Sirni membelah buah dan ternyata di dalamnya terdapat seorang bayi cantik yang kemudian diberi nama timun emas.Semakin hari timun emas tumbuh menjadi gadis jelita. Suatu hari datanglah raksasa untuk menagih janji.Raksasapun mengejarnya. Timun emaspun kemudian menebarkan biji timun ajaib yang menjadi ladang mentimun yang lebat buahnya. Raksasapun memakannya tapi buah timun itu malah menambah tenaga raksasa. Lalu timun emas menaburkan jarum, dalam sekejap tumbuhlan pohon-pohon bambu yang sangat tinggi dan tajam sehingga kaki raksasa menjadi berdarah-darah.",
    "createdAt": "17 Desember 2022"
  }
]
